tests/benchmark/socket_rpc_v3.yaml
config:
  target: "{{ $processEnvironment.LISK_SERVICE_URL }}/rpc-v3"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 15
      arrivalRate: 50
scenarios:
  - name: "Blocks"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.blocks", "params": {"limit": 10}}
      - emit:
          channel: "request"
          data: {"method": "get.blocks", "params": {"limit": 30}}
      - emit:
          channel: "request"
          data: {"method": "get.blocks", "params": {"limit": 100}}

  - name: "Blocks assets"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.blocks.assets", "params": {"limit": 10}}
      - emit:
          channel: "request"
          data: {"method": "get.blocks.assets", "params": {"limit": 30}}
      - emit:
          channel: "request"
          data: {"method": "get.blocks.assets", "params": {"limit": 100}}

  - name: "Transactions"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.transactions", "params": {"limit": 30}}
          response:
            match:
              json: "$.meta.count"
              value: 30

  - name: "Transactions statistics"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.transactions.statistics", "params": {"limit": 30, interval:'day'}}
          response:
            match:
              json: "$.meta.count"
              value: 30
  - name: "Transactions statistics"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.transactions.statistics", "params": {"limit": 30, interval:'month'}}
          response:
            match:
              json: "$.meta.count"
              value: 30

  - name: "Events"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.events", "params": {"limit": 10}}
      - emit:
          channel: "request"
          data: {"method": "get.events", "params": {"limit": 30}}
      - emit:
          channel: "request"
          data: {"method": "get.events", "params": {"limit": 100}}

  - name: "Validators"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.pos.validators", "params": {"limit": 30}}
      - emit:
          channel: "request"
          data: {"method": "get.pos.validators", "params": {"limit": 100}}
      - emit:
          channel: "request"
          data: {"method": "get.pos.validators", "params": {"limit": 101}}

  - name: "Generators"
    engine: "socketio"
    flow:
      - emit:
          channel: "request"
          data: {"method": "get.generators", "params": {"limit": 30}}
      - emit:
          channel: "request"
          data: {"method": "get.generators", "params": {"limit": 103}}